/* ----------------------------------------------------------------------------
 * 構成品目のキー
 * ------------------------------------------------------------------------- */ 
 export class ItemKey {
  constructor( readonly key: string ) {} 
}

/* ----------------------------------------------------------------------------
 * 構成品目
 * 一度作ったら基本的にそのまま。(名前を変えた時点で別物と扱う)
 * TODO
 * 情報が古い場合は、Outdatedとする。
 * 別に禁止はしないが、廃止したデータを触った場合は注意が必要だと知らせたい。
 * ------------------------------------------------------------------------- */ 
export class Item {
  constructor(
    public readonly key: ItemKey,
    public readonly path: string,
    public readonly name: string
  ) {}
}
